[{"model": "blog.post", "pk": 1, "fields": {"title": "The mudcloth artwork", "slug": "mudcloth", "author": 1, "updated_on": "2022-02-02T10:15:13.607Z", "content": "In traditional mud cloth production, men weave the cloth and women dye it. On narrow looms, strips of cotton fabric about 15 centimetres (5.9 in) wide are woven and stitched into cloths about 1 metre (3 ft) wide and 1.5 metres (5 ft) long.\r\n\r\nThe dyeing begins with a step invisible in the finished product: the cloth is soaked in a dye bath made from leaves of the n'gallama (Anogeissus leiocarpa) tree that have been mashed and boiled, or soaked. Now yellow, the cloth is sun-dried and then painted with designs using a piece of metal or wood. The paint, carefully and repeatedly applied to outline the intricate motifs, is a special mud, collected from riverbeds and fermented for up to a year in a clay jar. Because of a chemical reaction between the mud and the dyed cloth, the brown color remains after the mud is washed off. Finally, the yellow n'gallama dye is removed from the unpainted parts of the cloth by applying soap or bleach, rendering the finished cloth white.", "created_on": "2022-02-01T11:40:52.813Z", "status": 1}}, {"model": "blog.post", "pk": 15, "fields": {"title": "Blankets", "slug": "blankets", "author": 1, "updated_on": "2022-02-10T11:15:33.157Z", "content": "The blankets are made according to old traditions with hand-spun alpaca wool in a small weavery in Lima, Peru. The geometric pattern is inspired by the textiles of the Inca Empire that has one of the oldest and best preserved traditions of textile arts in the world. Fringes are hand-finished.", "created_on": "2022-02-10T11:15:33.157Z", "status": 1}}, {"model": "blog.post", "pk": 18, "fields": {"title": "The women behind the baskets", "slug": "the-women-behind-the-baskets", "author": 1, "updated_on": "2022-02-17T22:43:26.081Z", "content": "Weaving baskets is a tradition in Taita culture. The artisans of groups weaving fineweave baskets mostly live in the Taita hills. \r\n\r\nThis very fine  weave is the most traditional taita weaving, and the natural collection is dyed with old techniques from flowers and bark. 100% natural and 100% handmade.\r\n\r\nMost groups meet every two weeks to weave baskets together, and continue weaving in the meantime at home, on the bus or whilst walking to their neighbours.", "created_on": "2022-02-17T22:34:00.132Z", "status": 1}}, {"model": "blog.post", "pk": 19, "fields": {"title": "Fine weave sisal baskets", "slug": "about-the-baskets", "author": 1, "updated_on": "2022-02-17T22:42:55.614Z", "content": "These unique baskets are made out of extra thin sisal which is grown  on farms belonging to the basket weavers. The leaves of the sisal plant are used to obtain a fibre which is rolled to twine, and then be woven to a basket. With sisal twine rolled thinner than 2mm, a very tight density of knots per inch is achieved. The fineweave basket is lighter than its practical counterpart of the same size and considerably more time goes into a fineweave basket! \r\n\r\nThe Taita ladies pick the sisal, decorticate it, dye the fibres themselves and then roll the twine on their lap. Making baskets is a very labour intensive art. The baskets come in a number of different colours and patterns, with each design entirely made up by these artistic Taita ladies.", "created_on": "2022-02-17T22:37:31.466Z", "status": 1}}, {"model": "blog.post", "pk": 20, "fields": {"title": "hej", "slug": "hej", "author": 1, "updated_on": "2022-02-20T12:51:19.004Z", "content": "hej", "created_on": "2022-02-20T12:51:19.004Z", "status": 1}}]